gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_lockctrl/User/main.c
		/* 运行正常BackupApp */
		if ((BackUp == true) && (Stm32_GetSecondTick() > RUNNING_SUCCESS_BACKUP_APP_SEC)) {
			NET_NBIOT_BackupCurrentApp_Task();
			BackUp = false;
		}
	}
}

/**********************************************************************************************************
 @Function			void MainMajorCycleMqttSN(void)
 @Description			MainMajorCycleMqttSN
 @Input				void
 @Return				void
 @attention			MqttSN等待数据接收中需处理程序
**********************************************************************************************************/
void MainMajorCycleMqttSN(void)
{
	/* 小无线处理 */
	Radio_Trf_App_Task();
	
	/* 车辆检测 */
	Inspect_Spot_ExistenceDetect();
	
	/* 检测是否需要初始化传感器背景 */
	RollingOverInitSensorBackground();
	
	/* 日常处理 */
	MainHandleRoutine();
	
	/* NBIOT Data Processing */
	NET_NBIOT_DataProcessing(&NetNbiotClientHandler);
	
	/* 喂狗 */
	IWDG_Feed();
	
#if LOWPOWERMODE == LOWPOWERENABLE
	LowPowerBeforeSleepInit();
	LowPowerEnterStop();
	LowPowerAfterSleepInit();
#elif LOWPOWERMODE == LOWPOWERDISABLE
	Delay_MS(1000);
#endif
	
	/* 喂狗 */
	IWDG_Feed();
	
	/* 软重启计数器清0 */
	SystemSoftResetTime = 0;
}

/**********************************************************************************************************
 @Function			void MainMajorCycleOneNET(void)
 @Description			MainMajorCycleOneNET
 @Input				void
 @Return				void
 @attention			OneNET等待数据接收中需处理程序
**********************************************************************************************************/
void MainMajorCycleOneNET(void)
{
	/* 小无线处理 */
	Radio_Trf_App_Task();
	
	/* 检测是否需要初始化传感器背景 */
	RollingOverInitSensorBackground();
	
	/* 日常处理 */
	MainHandleRoutine();
	
	/* NBIOT Data Processing */
	NET_NBIOT_DataProcessing(&NetNbiotClientHandler);
	
	/* 喂狗 */
	IWDG_Feed();
	
	/* 软重启计数器清0 */
	SystemSoftResetTime = 0;
}

/* ============================================ 正放处理 =============================================== */

/**********************************************************************************************************
 @Function			void MainRollingEnteredUpWork(void)
 @Description			MainRollingEnteredUpWork					: 已进入正放工作状态
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainRollingEnteredUpWork(void)
{
	Radio_Trf_Printf("Entered Up Work");
	BEEP_CtrlRepeat_Extend(3, 30, 70);
#if NETPROTOCAL == NETCOAP
	NETCoapNeedSendCode.WorkInfoWait = 3;
#elif NETPROTOCAL == NETMQTTSN
	NETMqttSNNeedSendCode.InfoWorkWait = 3;
#elif NETPROTOCAL == NETONENET
	NETOneNETNeedSendCode.WorkInfoWait = 3;
#elif NETPROTOCAL == NETCTWING
	NETCTWingNeedSendCode.WorkInfoWait = 3;
#endif
	
	if (TCFG_SystemData.NBIotSentCountDay != 0) TCFG_SystemData.NBIotSentCountDay = 0;
	if (TCFG_EEPROM_GetNBIotSentCountDay() != 0) TCFG_EEPROM_SetNBIotSentCountDay(TCFG_SystemData.NBIotSentCountDay);
}

/**********************************************************************************************************
 @Function			void MainRollingEnteringUpWork(void)
 @Description			MainRollingEnteringUpWork				: 将进入正放工作状态
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainRollingEnteringUpWork(void)
{
	Radio_Trf_Printf("Entering Up Work");
	BEEP_CtrlRepeat_Extend(1, 500, 0);
}

/**********************************************************************************************************
 @Function			void MainRollingUpwardsActived(void)
 @Description			MainRollingUpwardsActived				: 正放工作中
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainRollingUpwardsActived(void)
{
	/* 车辆检测 */
	Inspect_Spot_ExistenceDetect();
	
	/* 日常处理 */
	MainHandleRoutine();
	
	if (!((NETCoapNeedSendCode.WorkInfoWait > 0) || (NETMqttSNNeedSendCode.InfoWorkWait > 0) || (NETOneNETNeedSendCode.WorkInfoWait > 0) || (NETCTWingNeedSendCode.WorkInfoWait > 0))) {
#if PRODUCTTEST_READ_TYPE
		if (ProductTest_Read() || (TCFG_Utility_Get_Device_BootCount() > PRODUCTTEST_OVER_BOOTCNT)) {
		#if NBIOT_SNEDCOUNTDAY_LIMIT_TYPE
			if (TCFG_Utility_Get_NBIot_SentCountDay() == TCFG_EEPROM_GetNBIotSentCountLimit()) {
			#if NETPROTOCAL == NETCOAP
				NETCoapNeedSendCode.DynamicInfo = 1;
			#elif NETPROTOCAL == NETMQTTSN
				NETMqttSNNeedSendCode.InfoDynamic = 1;
			#elif NETPROTOCAL == NETONENET
				NETOneNETNeedSendCode.DynamicInfo = 1;
			#elif NETPROTOCAL == NETCTWING
				NETCTWingNeedSendCode.DynamicInfo = 1;
			#endif
			}
			if (TCFG_Utility_Get_NBIot_SentCountDay() > TCFG_EEPROM_GetNBIotSentCountLimit() + 1) {
				if (NBIOTPOWER_IO_READ()) {
					NET_NBIOT_Initialization();
					NBIOTPOWER(OFF);
				}
			}
			else {
				/* NBIOT APP Task */
				NET_NBIOT_App_Task();
			}
		#else
			/* NBIOT APP Task */
			NET_NBIOT_App_Task();
		#endif
		}
		else {
			/* NBIOT Power OFF */
			if (NBIOTPOWER_IO_READ()) {
				NBIOT_Neul_NBxx_CheckReadIMEI(&NbiotClientHandler);
				NBIOT_Neul_NBxx_TestSupportedBands(&NbiotClientHandler, NBIOT_MODULE_BAND_SUPPORT);
				NET_NBIOT_Initialization();
				NBIOTPOWER(OFF);
			}
			if (NbiotClientHandler.Parameter.bandsupport != true) {
				Radio_Trf_Printf("imei:null or band:no support");
				BEEP_CtrlRepeat_Extend(3, 50, 25);
			}
			else {
				Radio_Trf_Printf("imei:%s", TCFG_Utility_Get_Nbiot_Imei_String());
			}
		}
#else
	#if NBIOT_SNEDCOUNTDAY_LIMIT_TYPE
		if (TCFG_Utility_Get_NBIot_SentCountDay() == TCFG_EEPROM_GetNBIotSentCountLimit()) {
		#if NETPROTOCAL == NETCOAP
			NETCoapNeedSendCode.DynamicInfo = 1;
		#elif NETPROTOCAL == NETMQTTSN
			NETMqttSNNeedSendCode.InfoDynamic = 1;
		#elif NETPROTOCAL == NETONENET
			NETOneNETNeedSendCode.DynamicInfo = 1;
		#elif NETPROTOCAL == NETCTWING
			NETCTWingNeedSendCode.DynamicInfo = 1;
		#endif
		}
		if (TCFG_Utility_Get_NBIot_SentCountDay() > TCFG_EEPROM_GetNBIotSentCountLimit() + 1) {
			if (NBIOTPOWER_IO_READ()) {
				NET_NBIOT_Initialization();
				NBIOTPOWER(OFF);
			}
		}
		else {
			/* NBIOT APP Task */
			NET_NBIOT_App_Task();
		}
	#else
		/* NBIOT APP Task */
		NET_NBIOT_App_Task();
	#endif
#endif
	}
	
	/* 遥控器编码处理 */
	OOK_EXTI_PollExecution(false);
	
	/* 车锁控制 */
	SPOT_Lock_App_Task();
	
	/* 小无线处理 */
	Radio_Trf_App_Task();
}

/**********************************************************************************************************
 @Function			void MainRollingEnteringUpWork(void)
 @Description			MainRollingEnteringUpWork				: 正放休眠中
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainRollingUpwardsSleep(void)
{
#if NBIOT_UPWARDSSLEEP_TYPE
	/* 日常处理 */
	MainHandleRoutine();
	
