gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_lockctrl/User/main.c
	if (TCFG_Utility_Get_Nbiot_IdleLifetime() > 0) {
		/* NBIOT APP Task */
		NET_NBIOT_App_Task();
	}
	else {
#endif
		/* NBIOT Power OFF */
		if (NBIOTPOWER_IO_READ()) {
			NET_NBIOT_Initialization();
			NBIOTPOWER(OFF);
		}
#if NBIOT_UPWARDSSLEEP_TYPE
	}
	
	/* 小无线处理 */
	Radio_Trf_App_Task();
#endif
}

/* ============================================ 倒放处理 =============================================== */

/**********************************************************************************************************
 @Function			void MainRollingEnteredDownSleep(void)
 @Description			MainRollingEnteredDownSleep				: 已进入倒放休眠状态
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainRollingEnteredDownSleep(void)
{
	BEEP_CtrlRepeat_Extend(1, 500, 0);
}

/**********************************************************************************************************
 @Function			void MainRollingEnteredDownWork(void)
 @Description			MainRollingEnteredDownWork				: 已进入倒放工作状态
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainRollingEnteredDownWork(void)
{
#if NETPROTOCAL == NETCOAP
	NETCoapNeedSendCode.WorkInfoWait = 3;
#elif NETPROTOCAL == NETMQTTSN
	NETMqttSNNeedSendCode.InfoWorkWait = 3;
#elif NETPROTOCAL == NETONENET
	NETOneNETNeedSendCode.WorkInfoWait = 3;
#elif NETPROTOCAL == NETCTWING
	NETCTWingNeedSendCode.WorkInfoWait = 3;
#endif
}

/**********************************************************************************************************
 @Function			void MainRollingEnteredDownSleepKeepActived(void)
 @Description			MainRollingEnteredDownSleepKeepActived		: 将进入倒放休眠状态前保持工作
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainRollingEnteredDownSleepKeepActived(void)
{
	/* 日常处理 */
	MainHandleRoutine();
	
	if (!((NETCoapNeedSendCode.WorkInfoWait > 0) || (NETMqttSNNeedSendCode.InfoWorkWait > 0) || (NETOneNETNeedSendCode.WorkInfoWait > 0) || (NETCTWingNeedSendCode.WorkInfoWait > 0))) {
#if PRODUCTTEST_READ_TYPE
		if (ProductTest_Read() || (TCFG_Utility_Get_Device_BootCount() > PRODUCTTEST_OVER_BOOTCNT)) {
			/* NBIOT APP Task */
			NET_NBIOT_App_Task();
		}
		else {
			/* NBIOT Power OFF */
			if (NBIOTPOWER_IO_READ()) {
				NET_NBIOT_Initialization();
				NBIOTPOWER(OFF);
			}
		}
#else
		/* NBIOT APP Task */
		NET_NBIOT_App_Task();
#endif
	}
}

/**********************************************************************************************************
 @Function			void MainRollingEnteringDownSleep(void)
 @Description			MainRollingEnteringDownSleep				: 将进入倒放休眠
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainRollingEnteringDownSleep(void)
{
	/* NBIOT Power OFF */
	if (NBIOTPOWER_IO_READ()) {
		NET_NBIOT_Initialization();
		NBIOTPOWER(OFF);
	}
}

/**********************************************************************************************************
 @Function			void MainRollingDownSleep(void)
 @Description			MainRollingDownSleep					: 倒放休眠中
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainRollingDownSleep(void)
{
#if NBIOT_DNWARDSSLEEP_TYPE
	/* 日常处理 */
	MainHandleRoutine();
	
	if (TCFG_Utility_Get_Nbiot_IdleLifetime() > 0) {
		/* NBIOT APP Task */
		NET_NBIOT_App_Task();
	}
	else {
#endif
		/* NBIOT Power OFF */
		if (NBIOTPOWER_IO_READ()) {
			NET_NBIOT_Initialization();
			NBIOTPOWER(OFF);
		}
#if NBIOT_DNWARDSSLEEP_TYPE
	}
#endif
}

/* ============================================ 日常处理 =============================================== */

/**********************************************************************************************************
 @Function			void MainHandleRoutine(void)
 @Description			MainHandleRoutine
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainHandleRoutine(void)
{
	uint8_t val8;
	
	/* Every Second Running */
	if (Stm32_GetSecondTick() != SystemRunningTime.seconds) {
		SystemRunningTime.seconds = Stm32_GetSecondTick();
		
	}
	/* Every Ten Secound Running */
	if ((Stm32_GetSecondTick() / 10) != SystemRunningTime.tenseconds) {
		SystemRunningTime.tenseconds = Stm32_GetSecondTick() / 10;
		
#if NETPROTOCAL == NETCOAP
		if (NETCoapNeedSendCode.WorkInfoWait > 0) {
			if (NETCoapNeedSendCode.WorkInfoWait > 1) {
				__NOP();
			}
			else if (NETCoapNeedSendCode.WorkInfoWait > 0) {
		#if ROLLINGOVER_WORKINFO_TYPE
			#if NBCOAP_SENDCODE_WORK_INFO
				NETCoapNeedSendCode.WorkInfo = 1;
			#endif
		#endif
			}
			NETCoapNeedSendCode.WorkInfoWait--;
		}
#endif
#if NETPROTOCAL == NETMQTTSN
		if (NETMqttSNNeedSendCode.InfoWorkWait > 0) {
			if (NETMqttSNNeedSendCode.InfoWorkWait > 1) {
				__NOP();
			}
			else if (NETMqttSNNeedSendCode.InfoWorkWait > 0) {
		#if ROLLINGOVER_WORKINFO_TYPE
			#if NBMQTTSN_SENDCODE_WORK_INFO
				NETMqttSNNeedSendCode.InfoWork = 1;
			#endif
		#endif
			}
			NETMqttSNNeedSendCode.InfoWorkWait--;
		}
#endif
#if NETPROTOCAL == NETONENET
		if (NETOneNETNeedSendCode.WorkInfoWait > 0) {
			if (NETOneNETNeedSendCode.WorkInfoWait > 1) {
				__NOP();
			}
			else if (NETOneNETNeedSendCode.WorkInfoWait > 0) {
		#if ROLLINGOVER_WORKINFO_TYPE
			#if NBONENET_SENDCODE_WORK_INFO
				NETOneNETNeedSendCode.WorkInfo = 1;
			#endif
		#endif
			}
			NETOneNETNeedSendCode.WorkInfoWait--;
		}
#endif
#if NETPROTOCAL == NETCTWING
		if (NETCTWingNeedSendCode.WorkInfoWait > 0) {
			if (NETCTWingNeedSendCode.WorkInfoWait > 1) {
				__NOP();
			}
			else if (NETCTWingNeedSendCode.WorkInfoWait > 0) {
		#if ROLLINGOVER_WORKINFO_TYPE
			#if NBCTWING_SENDCODE_WORK_INFO
				NETCTWingNeedSendCode.WorkInfo = 1;
			#endif
		#endif
			}
			NETCTWingNeedSendCode.WorkInfoWait--;
		}
#endif
		TCFG_Utility_Sub_Nbiot_IdleLifetime();
	}
	/* Every Minutes Running */
	if ((Stm32_GetSecondTick() / 60) != SystemRunningTime.minutes) {
		SystemRunningTime.minutes = Stm32_GetSecondTick() / 60;
		
#if NETDATACONNECT_TIMEOUT_TYPE
		if ((DeviceIdleMode == false) && (DeviceActivedMode == true)) {
			NetDataConnectTimeout++;
			if (NetDataConnectTimeout >= NETDATACONNECT_TIMEOUT_TIME) {
				Stm32_System_Software_Reboot(RBTMODE_NETCONNECT_OVERTIME);
			}
		}
		else {
			NetDataConnectTimeout = 0;
		}
#endif
	}
	/* Every FifteenMinutes Running */
	if ((Stm32_GetSecondTick() / 900) != SystemRunningTime.fifteenMinutes) {
		SystemRunningTime.fifteenMinutes = Stm32_GetSecondTick() / 900;
		
