gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_lockctrl/User/main.c
	}
	/* Every FortyMinutes Running */
	if ((Stm32_GetSecondTick() / 2400) != SystemRunningTime.fortyMinutes) {
		SystemRunningTime.fortyMinutes = Stm32_GetSecondTick() / 2400;
		
		if (RTC_Time_GetCurrentHour() == 7) {
			if (Inspect_Message_SpotStatusisEmpty() != false) {
				NET_NBIOT_Initialization();
			}
			
			if ((TCFG_EEPROM_GetNBIotSentCountDay() != 0) || (TCFG_SystemData.NBIotSentCountDay != 0)) {
				TCFG_SystemData.NBIotSentCountDay = 0;
				TCFG_EEPROM_SetNBIotSentCountDay(TCFG_SystemData.NBIotSentCountDay);
			}
		}
	}
	/* Every Hours Running */
	if ((Stm32_GetSecondTick() / 3600) != SystemRunningTime.hours) {
		SystemRunningTime.hours = Stm32_GetSecondTick() / 3600;
		
		val8 = TCFG_EEPROM_GetCoapRATimeHour();
		if ((val8 != 0) && (SystemRunningTime.hours % val8 == 0)) {
			NBIOT_COAP_RA_NORMAL_SET_STATE(&NbiotClientHandler, true);
		}
	}
	/* Every TwoHours Running */
	if ((Stm32_GetSecondTick() / 7200) != SystemRunningTime.twoHours) {
		SystemRunningTime.twoHours = Stm32_GetSecondTick() / 7200;
		
		if (TCFG_GetRadarCount() != TCFG_EEPROM_GetRadarCount()) {
			TCFG_EEPROM_SetRadarCount(TCFG_GetRadarCount());
		}
		
		TCFG_SystemData.MagBackgroundX = Qmc5883lData.X_Back;
		TCFG_SystemData.MagBackgroundY = Qmc5883lData.Y_Back;
		TCFG_SystemData.MagBackgroundZ = Qmc5883lData.Z_Back;
		TCFG_EEPROM_SetMagBackgroud(TCFG_SystemData.MagBackgroundX, TCFG_SystemData.MagBackgroundY, TCFG_SystemData.MagBackgroundZ);
		
		TCFG_SystemData.MagBackgroudTemp = Qmc5883lData.temp_back;
		TCFG_EEPROM_SetMagBackgroudTemp(TCFG_SystemData.MagBackgroudTemp);
	}
	/* Every FourHours Running */
	if ((Stm32_GetSecondTick() / (4*3600)) != SystemRunningTime.fourHours) {
		SystemRunningTime.fourHours = Stm32_GetSecondTick() / (4*3600);
		
	}
	/* Every Day Running */
	if ((Stm32_GetSecondTick() / (24*3600)) != SystemRunningTime.days) {
		SystemRunningTime.days = Stm32_GetSecondTick() / (24*3600);
		
#if NETPROTOCAL == NETCOAP
	#if NBCOAP_SENDCODE_WORK_INFO
		NETCoapNeedSendCode.WorkInfo = 1;
	#endif
	#if NBCOAP_SENDCODE_DYNAMIC_INFO
		NETCoapNeedSendCode.DynamicInfo = 1;
	#endif
#elif NETPROTOCAL == NETMQTTSN
	#if NBMQTTSN_SENDCODE_WORK_INFO
		NETMqttSNNeedSendCode.InfoWork = 1;
	#endif
	#if NBMQTTSN_SENDCODE_DYNAMIC_INFO
		NETMqttSNNeedSendCode.InfoDynamic = 1;
	#endif
#elif NETPROTOCAL == NETONENET
	#if NBONENET_SENDCODE_WORK_INFO
		NETOneNETNeedSendCode.WorkInfo = 1;
	#endif
	#if NBONENET_SENDCODE_DYNAMIC_INFO
		NETOneNETNeedSendCode.DynamicInfo = 1;
	#endif
#elif NETPROTOCAL == NETCTWING
	#if NBCTWING_SENDCODE_WORK_INFO
		NETCTWingNeedSendCode.WorkInfo = 1;
	#endif
	#if NBCTWING_SENDCODE_DYNAMIC_INFO
		NETCTWingNeedSendCode.DynamicInfo = 1;
	#endif
#endif
		
		TCFG_SystemData.CoapConnectTime = TCFG_Utility_GetCoapConnectTime();
		TCFG_EEPROM_SetCoapConnectTime(TCFG_SystemData.CoapConnectTime);
		
		TCFG_SystemData.CoapIdleTime = TCFG_Utility_GetCoapIdleTime();
		TCFG_EEPROM_SetCoapIdleTime(TCFG_SystemData.CoapIdleTime);
		
		NBIOT_COAP_RA_NORMAL_SET_STATE(&NbiotClientHandler, true);
		TCFG_Utility_Set_Nbiot_IdleLifetime(NBIOT_MAX_LIFETIME);
		
#if NETPROTOCAL == NETMQTTSN
	#if MQTTSN_DNS_SERVER_TYPE == MQTTSN_DNS_SERVER_ENABLE
		DNS_Analysis_Set_CtrlState(&DNSClientHandler, true);
	#endif
#endif
	}
	/* Every Week Running */
	if ((Stm32_GetSecondTick() / (24*3600*7)) != SystemRunningTime.weeks) {
		SystemRunningTime.weeks = Stm32_GetSecondTick() / (24*3600*7);
		
#if NETPROTOCAL == NETCOAP
	#if NBCOAP_SENDCODE_BASIC_INFO
		NETCoapNeedSendCode.BasicInfo = 1;
	#endif
#elif NETPROTOCAL == NETMQTTSN
	#if NBMQTTSN_SENDCODE_BASIC_INFO
		NETMqttSNNeedSendCode.InfoBasic = 1;
	#endif
#elif NETPROTOCAL == NETONENET
	#if NBONENET_SENDCODE_BASIC_INFO
		NETOneNETNeedSendCode.BasicInfo = 1;
	#endif
#elif NETPROTOCAL == NETCTWING
	#if NBCTWING_SENDCODE_BASIC_INFO
		NETCTWingNeedSendCode.BasicInfo = 1;
	#endif
#endif
	}
}


#ifdef	DEVICE_DEBUG
/********************************************* DEBUG *****************************************************/
/****************************************** Debug Ending *************************************************/
/**********************************************************************************************************
 @Function			void DeBugMain(void)
 @Description			DeBugMain
 @Input				void
 @Return				void
**********************************************************************************************************/
void DeBugMain(void)
{
	TCFG_EEPROM_SetBootCount(0);
	
#if 0
	NBIOT_Neul_NBxx_HardwareReboot(&NbiotClientHandler, 8000);
#endif
	
#if 0
	INFRARED_TUBE_TRANSMIT_ENABLE();
#endif
	
#if 0
	SPOT_Lock_Initialization();
#endif
	
	while (true) {
		
#if 0
		Radio_Trf_Printf("Infr : %d", INFRARED_TUBE_RECEIVE_STATE());
#endif
		
#if 0
		SPOT_Lock_App_Task();
#endif
		
#if DEBUGLOWPOWERMODE == DEBUGLOWPOWERENABLE
		LowPowerBeforeSleepInit();
		LowPowerEnterStop();
		LowPowerAfterSleepInit();
#elif DEBUGLOWPOWERMODE == DEBUGLOWPOWERDISABLE
		/* 小无线处理 */
		Radio_Trf_App_Task();
		
		Delay_MS(1000);
#endif
		
		/* 喂狗 */
		IWDG_Feed();
		
		/* 软重启计数器清0 */
		SystemSoftResetTime = 0;
		
		/* 运行正常BootCount清0 */
		if ((BootUp == true) && (Stm32_GetSecondTick() > RUNNING_SUCCESS_BOOT_COUNT_SEC)) {
			TCFG_EEPROM_SetBootCount(0);
			if (TCFG_EEPROM_GetBootCount() == 0) {
				BootUp = false;
			}
		}
		
		/* 运行正常BackupApp */
		if ((BackUp == true) && (Stm32_GetSecondTick() > RUNNING_SUCCESS_BACKUP_APP_SEC)) {
			NET_NBIOT_BackupCurrentApp_Task();
			BackUp = false;
		}
	}
}
#endif

/********************************************** END OF FLEE **********************************************/
